# $$人工智能python可视化及分析库考试题：五$$

### 第一步:导入相关模块

In [9]:
import pandas as pd

### 第二步：加载datasets目录下US_Baby_names_right.csv文件数据并查看数据的基本信息

In [8]:
baby_names = pd.read_csv('datasets/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### 第三步:查看前十行数据

In [34]:
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

>数据解读：
1. Name    名字
1. Year    婴儿出生的名字
1. Gender   婴儿性别
1. State    婴儿出生的地区缩写
1. Count    该名字被使用的次数

### 第三步：写出删除 Unname:0和Id列数据的两种方法，第二种注释即可

In [10]:
# deletes Unnamed: 0
del baby_names['Unnamed: 0']

# deletes Unnamed: 0
del baby_names['Id']

baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### 第四步：写出能够判断出数据集中男孩名字多还是女孩名字多的代码并给出结论

In [13]:
baby_names["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### 第五步：按照Name字段将数据集进行分组并求和赋值给变量names，最后输出前五行

In [16]:
names = baby_names.groupby("Name").sum()
names.head()

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6

### 第六步：按照每个名字被使用的次数（count）对第五步中结果进行降序排序，得出最受欢迎的的五个名字

In [29]:
names.sort_values("Count",ascending=False).head()

             Year   Count
Name
Jacob     1141099  242874
Emma      1137085  214852
Michael   1161152  214405
Ethan     1139091  209277
Isabella  1137090  204798

### 第七步：在数据集中，共出现了多少个名字？(不包含重复项，至少使用两种方法)

In [27]:
len(baby_names["Name"].unique())
len(names)

17632

### 第八步：出现次数最少的名字共有几个？

In [32]:
len(names[names.Count == names.Count.min()])

2578

### 第九步：根据names变量中的数据，删除掉Year列数据后，得出如下所示的基本统计参数

In [35]:
names.drop(["Year"],axis=1).describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000